In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

visa_df=pd.read_csv("Visadataset.csv")

cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [2]:
dict1={'Name':['Ramesh','Suresh','Satish',np.nan],
      'Age':[20,33,np.nan,46],
       'City':[np.nan,'Hyd','Ong','Banglore']
      }
df=pd.DataFrame(dict1)
df

     Name   Age      City
0  Ramesh  20.0       NaN
1  Suresh  33.0       Hyd
2  Satish   NaN       Ong
3     NaN  46.0  Banglore

In [3]:
df.to_csv('missingvalues.csv',index=False)

In [4]:
df.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

In [5]:
df.dropna(axis=0)

     Name   Age City
1  Suresh  33.0  Hyd

In [6]:
df

     Name   Age      City
0  Ramesh  20.0       NaN
1  Suresh  33.0       Hyd
2  Satish   NaN       Ong
3     NaN  46.0  Banglore

In [7]:
data1={"name":[np.nan,'javeed','mashu','munnu'],
      "age":[20,34,np.nan,49],
       "city":['ong',np.nan,'bang','hyd'],
       "Company":['google','microsoft','tcs','accenture']
      }
df1=pd.DataFrame(data1)
df1

     name   age  city    Company
0     NaN  20.0   ong     google
1  javeed  34.0   NaN  microsoft
2   mashu   NaN  bang        tcs
3   munnu  49.0   hyd  accenture

In [8]:
df1.dropna(axis=1)

     Company
0     google
1  microsoft
2        tcs
3  accenture

**Fillna**

In [9]:
df1['age'].fillna(30)

0    20.0
1    34.0
2    30.0
3    49.0
Name: age, dtype: float64

In [10]:
df1['city'].fillna('Srikakulam')

0           ong
1    Srikakulam
2          bang
3           hyd
Name: city, dtype: object

In [21]:
import warnings
warnings.filterwarnings("ignore")
df1.fillna(method='pad',axis=0)

     name   age  city    Company
0     NaN  20.0   ong     google
1  javeed  34.0   ong  microsoft
2   mashu  34.0  bang        tcs
3   munnu  49.0   hyd  accenture

In [22]:
df1.fillna(method='bfill')

     name   age  city    Company
0  javeed  20.0   ong     google
1  javeed  34.0  bang  microsoft
2   mashu  49.0  bang        tcs
3   munnu  49.0   hyd  accenture

In [13]:
import warnings
warnings.filterwarnings('ignore')
df1.fillna(method='ffill')

     name   age  city    Company
0     NaN  20.0   ong     google
1  javeed  34.0   ong  microsoft
2   mashu  34.0  bang        tcs
3   munnu  49.0   hyd  accenture

In [14]:
df1.fillna(method='backfill')

     name   age  city    Company
0  javeed  20.0   ong     google
1  javeed  34.0  bang  microsoft
2   mashu  49.0  bang        tcs
3   munnu  49.0   hyd  accenture

In [15]:
df1['age'].fillna(round(df1['age'].mean(),2))

0    20.00
1    34.00
2    34.33
3    49.00
Name: age, dtype: float64

In [16]:
df1['name'].fillna(df1['name'].mode())

0    javeed
1    javeed
2     mashu
3     munnu
Name: name, dtype: object

In [17]:
df1['age'].fillna(round(df1['age'].median(),2))

0    20.0
1    34.0
2    34.0
3    49.0
Name: age, dtype: float64

**KNN imputer**

In [18]:
from sklearn import impute
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

In [20]:
imputer=impute.KNNImputer(n_neighbors=2,weights='uniform')
imputer.fit_transform(df1[['age']])

array([[20.        ],
       [34.        ],
       [34.33333333],
       [49.        ]])